---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.NeedsSubSchemaGUID
source: html/a528302b-2597-d7e2-4282-71c23eeba4d9.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.FieldBuilder.NeedsSubSchemaGUID Method

Checks whether the SubSchema GUID needs to be explicitly specified for this field type.

## Syntax (C#)
```csharp
public bool NeedsSubSchemaGUID()
```

## Returns
True if SubSchemaGUID is required.